RT-Thread/rt-thread/bsp/hc32/ev_hc32f4a8_lqfp176/board/config/dma_config.h
/* DMA1 ch6 */
#if defined(BSP_SPI4_RX_USING_DMA) && !defined(SPI4_RX_DMA_INSTANCE)
#define SPI4_RX_DMA_INSTANCE            CM_DMA1
#define SPI4_RX_DMA_CHANNEL             DMA_CH6
#define SPI4_RX_DMA_CLOCK               (PWC_FCG0_DMA1 | PWC_FCG0_AOS)
#define SPI4_RX_DMA_TRIG_SELECT         AOS_DMA1_6
#define SPI4_RX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH6
#define SPI4_RX_DMA_IRQn                BSP_DMA1_CH6_IRQ_NUM
#define SPI4_RX_DMA_INT_PRIO            BSP_DMA1_CH6_IRQ_PRIO
#define SPI4_RX_DMA_INT_SRC             INT_SRC_DMA1_TC6
#elif defined(BSP_I2C4_TX_USING_DMA) && !defined(I2C4_TX_DMA_INSTANCE)
#define I2C4_TX_DMA_INSTANCE            CM_DMA1
#define I2C4_TX_DMA_CHANNEL             DMA_CH6
#define I2C4_TX_DMA_CLOCK               (PWC_FCG0_DMA1 | PWC_FCG0_AOS)
#define I2C4_TX_DMA_TRIG_SELECT         AOS_DMA1_6
#define I2C4_TX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH6
#define I2C4_TX_DMA_IRQn                BSP_DMA1_CH6_IRQ_NUM
#define I2C4_TX_DMA_INT_PRIO            BSP_DMA1_CH6_IRQ_PRIO
#define I2C4_TX_DMA_INT_SRC             INT_SRC_DMA1_TC6
#elif defined(BSP_UART9_RX_USING_DMA) && !defined(UART9_RX_DMA_INSTANCE)
#define UART9_RX_DMA_INSTANCE           CM_DMA1
#define UART9_RX_DMA_CHANNEL            DMA_CH6
#define UART9_RX_DMA_CLOCK              (PWC_FCG0_DMA1 | PWC_FCG0_AOS)
#define UART9_RX_DMA_TRIG_SELECT        AOS_DMA1_6
#define UART9_RX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH6
#define UART9_RX_DMA_IRQn               BSP_DMA1_CH6_IRQ_NUM
#define UART9_RX_DMA_INT_PRIO           BSP_DMA1_CH6_IRQ_PRIO
#define UART9_RX_DMA_INT_SRC            INT_SRC_DMA1_TC6
#endif

/* DMA1 ch7 */
#if defined(BSP_SPI4_TX_USING_DMA) && !defined(SPI4_TX_DMA_INSTANCE)
#define SPI4_TX_DMA_INSTANCE            CM_DMA1
#define SPI4_TX_DMA_CHANNEL             DMA_CH7
#define SPI4_TX_DMA_CLOCK               (PWC_FCG0_DMA1 | PWC_FCG0_AOS)
#define SPI4_TX_DMA_TRIG_SELECT         AOS_DMA1_7
#define SPI4_TX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH7
#define SPI4_TX_DMA_IRQn                BSP_DMA1_CH7_IRQ_NUM
#define SPI4_TX_DMA_INT_PRIO            BSP_DMA1_CH7_IRQ_PRIO
#define SPI4_TX_DMA_INT_SRC             INT_SRC_DMA1_TC7
#elif defined(BSP_I2C4_RX_USING_DMA) && !defined(I2C4_RX_DMA_INSTANCE)
#define I2C4_RX_DMA_INSTANCE            CM_DMA1
#define I2C4_RX_DMA_CHANNEL             DMA_CH7
#define I2C4_RX_DMA_CLOCK               (PWC_FCG0_DMA1 | PWC_FCG0_AOS)
#define I2C4_RX_DMA_TRIG_SELECT         AOS_DMA1_7
#define I2C4_RX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH7
#define I2C4_RX_DMA_IRQn                BSP_DMA1_CH7_IRQ_NUM
#define I2C4_RX_DMA_INT_PRIO            BSP_DMA1_CH7_IRQ_PRIO
#define I2C4_RX_DMA_INT_SRC             INT_SRC_DMA1_TC7
#elif defined(BSP_UART9_TX_USING_DMA) && !defined(UART9_TX_DMA_INSTANCE)
#define UART9_TX_DMA_INSTANCE           CM_DMA1
#define UART9_TX_DMA_CHANNEL            DMA_CH7
#define UART9_TX_DMA_CLOCK              (PWC_FCG0_DMA1 | PWC_FCG0_AOS)
#define UART9_TX_DMA_TRIG_SELECT        AOS_DMA1_7
#define UART9_TX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH7
#define UART9_TX_DMA_IRQn               BSP_DMA1_CH7_IRQ_NUM
#define UART9_TX_DMA_INT_PRIO           BSP_DMA1_CH7_IRQ_PRIO
#define UART9_TX_DMA_INT_SRC            INT_SRC_DMA1_TC7
#endif

/* DMA1 ch8 */
#if defined(BSP_SPI5_TX_USING_DMA) && !defined(SPI5_TX_DMA_INSTANCE)
#define SPI5_TX_DMA_INSTANCE            CM_DMA1
#define SPI5_TX_DMA_CHANNEL             DMA_CH8
#define SPI5_TX_DMA_CLOCK               (PWC_FCG0_DMA1 | PWC_FCG0_AOS)
#define SPI5_TX_DMA_TRIG_SELECT         AOS_DMA1_8
#define SPI5_TX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH8
#define SPI5_TX_DMA_IRQn                BSP_DMA1_CH8_IRQ_NUM
#define SPI5_TX_DMA_INT_PRIO            BSP_DMA1_CH8_IRQ_PRIO
#define SPI5_TX_DMA_INT_SRC             INT_SRC_DMA1_TC8
#endif

/* DMA1 ch9 */
#if defined(BSP_SPI6_TX_USING_DMA) && !defined(SPI6_TX_DMA_INSTANCE)
#define SPI6_TX_DMA_INSTANCE            CM_DMA1
#define SPI6_TX_DMA_CHANNEL             DMA_CH9
#define SPI6_TX_DMA_CLOCK               (PWC_FCG0_DMA1 | PWC_FCG0_AOS)
#define SPI6_TX_DMA_TRIG_SELECT         AOS_DMA1_9
#define SPI6_TX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH9
#define SPI6_TX_DMA_IRQn                BSP_DMA1_CH9_IRQ_NUM
#define SPI6_TX_DMA_INT_PRIO            BSP_DMA1_CH9_IRQ_PRIO
#define SPI6_TX_DMA_INT_SRC             INT_SRC_DMA1_TC9
#endif

/* DMA2 ch0 */
#if defined(BSP_UART1_RX_USING_DMA) && !defined(UART1_RX_DMA_INSTANCE)
#define UART1_RX_DMA_INSTANCE           CM_DMA2
#define UART1_RX_DMA_CHANNEL            DMA_CH0
#define UART1_RX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART1_RX_DMA_TRIG_SELECT        AOS_DMA2_0
#define UART1_RX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH0
#define UART1_RX_DMA_IRQn               BSP_DMA2_CH0_IRQ_NUM
#define UART1_RX_DMA_INT_PRIO           BSP_DMA2_CH0_IRQ_PRIO
#define UART1_RX_DMA_INT_SRC            INT_SRC_DMA2_TC0
#elif defined(BSP_I2C5_TX_USING_DMA) && !defined(I2C5_TX_DMA_INSTANCE)
#define I2C5_TX_DMA_INSTANCE            CM_DMA2
#define I2C5_TX_DMA_CHANNEL             DMA_CH0
#define I2C5_TX_DMA_CLOCK               (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define I2C5_TX_DMA_TRIG_SELECT         AOS_DMA2_0
#define I2C5_TX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH0
#define I2C5_TX_DMA_IRQn                BSP_DMA2_CH0_IRQ_NUM
#define I2C5_TX_DMA_INT_PRIO            BSP_DMA2_CH0_IRQ_PRIO
#define I2C5_TX_DMA_INT_SRC             INT_SRC_DMA2_TC0
#endif

/* DMA2 ch1 */
#if defined(BSP_UART1_TX_USING_DMA) && !defined(UART1_TX_DMA_INSTANCE)
#define UART1_TX_DMA_INSTANCE           CM_DMA2
#define UART1_TX_DMA_CHANNEL            DMA_CH1
#define UART1_TX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART1_TX_DMA_TRIG_SELECT        AOS_DMA2_1
#define UART1_TX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH1
#define UART1_TX_DMA_IRQn               BSP_DMA2_CH1_IRQ_NUM
#define UART1_TX_DMA_INT_PRIO           BSP_DMA2_CH1_IRQ_PRIO
#define UART1_TX_DMA_INT_SRC            INT_SRC_DMA2_TC1
#elif defined(BSP_I2C5_RX_USING_DMA) && !defined(I2C5_RX_DMA_INSTANCE)
#define I2C5_RX_DMA_INSTANCE            CM_DMA2
#define I2C5_RX_DMA_CHANNEL             DMA_CH1
#define I2C5_RX_DMA_CLOCK               (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define I2C5_RX_DMA_TRIG_SELECT         AOS_DMA2_1
#define I2C5_RX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH1
#define I2C5_RX_DMA_IRQn                BSP_DMA2_CH1_IRQ_NUM
#define I2C5_RX_DMA_INT_PRIO            BSP_DMA2_CH1_IRQ_PRIO
#define I2C5_RX_DMA_INT_SRC             INT_SRC_DMA2_TC1
#endif

