RT-Thread/rt-thread/bsp/hc32/ev_hc32f4a8_lqfp176/board/config/dma_config.h
/* DMA2 ch2 */
#if defined(BSP_UART2_RX_USING_DMA) && !defined(UART2_RX_DMA_INSTANCE)
#define UART2_RX_DMA_INSTANCE           CM_DMA2
#define UART2_RX_DMA_CHANNEL            DMA_CH2
#define UART2_RX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART2_RX_DMA_TRIG_SELECT        AOS_DMA2_2
#define UART2_RX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH2
#define UART2_RX_DMA_IRQn               BSP_DMA2_CH2_IRQ_NUM
#define UART2_RX_DMA_INT_PRIO           BSP_DMA2_CH2_IRQ_PRIO
#define UART2_RX_DMA_INT_SRC            INT_SRC_DMA2_TC2
#elif defined(BSP_I2C6_TX_USING_DMA) && !defined(I2C6_TX_DMA_INSTANCE)
#define I2C6_TX_DMA_INSTANCE            CM_DMA2
#define I2C6_TX_DMA_CHANNEL             DMA_CH2
#define I2C6_TX_DMA_CLOCK               (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define I2C6_TX_DMA_TRIG_SELECT         AOS_DMA2_2
#define I2C6_TX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH2
#define I2C6_TX_DMA_IRQn                BSP_DMA2_CH2_IRQ_NUM
#define I2C6_TX_DMA_INT_PRIO            BSP_DMA2_CH2_IRQ_PRIO
#define I2C6_TX_DMA_INT_SRC             INT_SRC_DMA2_TC2
#endif

/* DMA2 ch3 */
#if defined(BSP_UART2_TX_USING_DMA) && !defined(UART2_TX_DMA_INSTANCE)
#define UART2_TX_DMA_INSTANCE           CM_DMA2
#define UART2_TX_DMA_CHANNEL            DMA_CH3
#define UART2_TX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART2_TX_DMA_TRIG_SELECT        AOS_DMA2_3
#define UART2_TX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH3
#define UART2_TX_DMA_IRQn               BSP_DMA2_CH3_IRQ_NUM
#define UART2_TX_DMA_INT_PRIO           BSP_DMA2_CH3_IRQ_PRIO
#define UART2_TX_DMA_INT_SRC            INT_SRC_DMA2_TC3
#elif defined(BSP_I2C6_RX_USING_DMA) && !defined(I2C6_RX_DMA_INSTANCE)
#define I2C6_RX_DMA_INSTANCE            CM_DMA2
#define I2C6_RX_DMA_CHANNEL             DMA_CH3
#define I2C6_RX_DMA_CLOCK               (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define I2C6_RX_DMA_TRIG_SELECT         AOS_DMA2_3
#define I2C6_RX_DMA_TRANS_FLAG          DMA_FLAG_TC_CH3
#define I2C6_RX_DMA_IRQn                BSP_DMA2_CH3_IRQ_NUM
#define I2C6_RX_DMA_INT_PRIO            BSP_DMA2_CH3_IRQ_PRIO
#define I2C6_RX_DMA_INT_SRC             INT_SRC_DMA2_TC3
#endif

/* DMA2 ch4 */
#if defined(BSP_UART5_RX_USING_DMA) && !defined(UART5_RX_DMA_INSTANCE)
#define UART5_RX_DMA_INSTANCE           CM_DMA2
#define UART5_RX_DMA_CHANNEL            DMA_CH4
#define UART5_RX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART5_RX_DMA_TRIG_SELECT        AOS_DMA2_4
#define UART5_RX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH4
#define UART5_RX_DMA_IRQn               BSP_DMA2_CH4_IRQ_NUM
#define UART5_RX_DMA_INT_PRIO           BSP_DMA2_CH4_IRQ_PRIO
#define UART5_RX_DMA_INT_SRC            INT_SRC_DMA2_TC4
#elif defined(BSP_UART6_RX_USING_DMA) && !defined(UART6_RX_DMA_INSTANCE)
#define UART6_RX_DMA_INSTANCE           CM_DMA2
#define UART6_RX_DMA_CHANNEL            DMA_CH4
#define UART6_RX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART6_RX_DMA_TRIG_SELECT        AOS_DMA2_4
#define UART6_RX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH4
#define UART6_RX_DMA_IRQn               BSP_DMA2_CH4_IRQ_NUM
#define UART6_RX_DMA_INT_PRIO           BSP_DMA2_CH4_IRQ_PRIO
#define UART6_RX_DMA_INT_SRC            INT_SRC_DMA2_TC4
#endif

/* DMA2 ch5 */
#if defined(BSP_UART5_TX_USING_DMA) && !defined(UART5_TX_DMA_INSTANCE)
#define UART5_TX_DMA_INSTANCE           CM_DMA2
#define UART5_TX_DMA_CHANNEL            DMA_CH5
#define UART5_TX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART5_TX_DMA_TRIG_SELECT        AOS_DMA2_5
#define UART5_TX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH5
#define UART5_TX_DMA_IRQn               BSP_DMA2_CH5_IRQ_NUM
#define UART5_TX_DMA_INT_PRIO           BSP_DMA2_CH5_IRQ_PRIO
#define UART5_TX_DMA_INT_SRC            INT_SRC_DMA2_TC5
#elif defined(BSP_UART6_TX_USING_DMA) && !defined(UART6_TX_DMA_INSTANCE)
#define UART6_TX_DMA_INSTANCE           CM_DMA2
#define UART6_TX_DMA_CHANNEL            DMA_CH5
#define UART6_TX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART6_TX_DMA_TRIG_SELECT        AOS_DMA2_5
#define UART6_TX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH5
#define UART6_TX_DMA_IRQn               BSP_DMA2_CH5_IRQ_NUM
#define UART6_TX_DMA_INT_PRIO           BSP_DMA2_CH5_IRQ_PRIO
#define UART6_TX_DMA_INT_SRC            INT_SRC_DMA2_TC5
#endif

/* DMA2 ch6 */
#if defined(BSP_UART7_RX_USING_DMA) && !defined(UART7_RX_DMA_INSTANCE)
#define UART7_RX_DMA_INSTANCE           CM_DMA2
#define UART7_RX_DMA_CHANNEL            DMA_CH6
#define UART7_RX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART7_RX_DMA_TRIG_SELECT        AOS_DMA2_6
#define UART7_RX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH6
#define UART7_RX_DMA_IRQn               BSP_DMA2_CH6_IRQ_NUM
#define UART7_RX_DMA_INT_PRIO           BSP_DMA2_CH6_IRQ_PRIO
#define UART7_RX_DMA_INT_SRC            INT_SRC_DMA2_TC6
#elif defined(BSP_UART10_RX_USING_DMA) && !defined(UART10_RX_DMA_INSTANCE)
#define UART10_RX_DMA_INSTANCE          CM_DMA2
#define UART10_RX_DMA_CHANNEL           DMA_CH6
#define UART10_RX_DMA_CLOCK             (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART10_RX_DMA_TRIG_SELECT       AOS_DMA2_6
#define UART10_RX_DMA_TRANS_FLAG        DMA_FLAG_TC_CH6
#define UART10_RX_DMA_IRQn              BSP_DMA2_CH6_IRQ_NUM
#define UART10_RX_DMA_INT_PRIO          BSP_DMA2_CH6_IRQ_PRIO
#define UART10_RX_DMA_INT_SRC           INT_SRC_DMA2_TC6
#endif

/* DMA2 ch7 */
#if defined(BSP_UART7_TX_USING_DMA) && !defined(UART7_TX_DMA_INSTANCE)
#define UART7_TX_DMA_INSTANCE           CM_DMA2
#define UART7_TX_DMA_CHANNEL            DMA_CH7
#define UART7_TX_DMA_CLOCK              (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART7_TX_DMA_TRIG_SELECT        AOS_DMA2_7
#define UART7_TX_DMA_TRANS_FLAG         DMA_FLAG_TC_CH7
#define UART7_TX_DMA_IRQn               BSP_DMA2_CH7_IRQ_NUM
#define UART7_TX_DMA_INT_PRIO           BSP_DMA2_CH7_IRQ_PRIO
#define UART7_TX_DMA_INT_SRC            INT_SRC_DMA2_TC7
#elif defined(BSP_UART10_TX_USING_DMA) && !defined(UART10_TX_DMA_INSTANCE)
#define UART10_TX_DMA_INSTANCE          CM_DMA2
#define UART10_TX_DMA_CHANNEL           DMA_CH7
#define UART10_TX_DMA_CLOCK             (PWC_FCG0_DMA2 | PWC_FCG0_AOS)
#define UART10_TX_DMA_TRIG_SELECT       AOS_DMA2_7
#define UART10_TX_DMA_TRANS_FLAG        DMA_FLAG_TC_CH7
#define UART10_TX_DMA_IRQn              BSP_DMA2_CH7_IRQ_NUM
#define UART10_TX_DMA_INT_PRIO          BSP_DMA2_CH7_IRQ_PRIO
#define UART10_TX_DMA_INT_SRC           INT_SRC_DMA2_TC7
#endif


#ifdef __cplusplus
}
#endif


#endif /* __DMA_CONFIG_H__ */
